Dlubal.RFEM5.ISubCombinations
Interface for working with sub-combinations

Dlubal.RFEM5.ISubCombinations.SetSubCombination(System.Int32,System.String)
Sets sub-combination parameters
CombinationNo: Number of leading combination.
Definition: Definition of sub-combination.

Dlubal.RFEM5.ISubCombinations.Clean
Removes sub-combination

Dlubal.RFEM5.ISubCombinations.Calculate
Calculates results of defined sub-combination and returns list of errors occurred during the calculation.
Returns: Array of errors that occurred during the calculation.

Dlubal.RFEM5.ISubCombinations.GetResultsInRasterPoints
Gets results interface. Results are in raster points.
Returns: Results interface

Dlubal.RFEM5.ISubCombinations.GetResultsInFeNodes
Gets results interface. Results are in FE mesh nodes
Returns: Results interface